БПКР/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяТрудовогоКодекса</name>
    <type>
      <types>CatalogRef.СтатьиТрудовогоКодекса</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/ПлановыеНачисленияНачало/ПлановыеНачисленияНачало.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияНачало</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВидыНачислений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/ПлановыеНачисленияОкончание/ПлановыеНачисленияОкончание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияОкончание</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВидыНачислений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.КадровоеПеремещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/СтатусыСотрудников/СтатусыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Статусы</types>
    </type>
  </resources>
  <resources>
    <name>ДопВычет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПризнакРезидентства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/НормыБольничныхЛистов/НормыБольничныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыБольничныхЛистов</name>
  <resources>
    <name>ДнейОрганизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентБеременность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерЗаСчетСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазмерБеременностьЗаСчетСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НижняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Catalogs/СпособыОтраженияЗаработнойПлаты/СпособыОтраженияЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияЗаработнойПлаты</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВидыНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоЗатрат1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоЗатрат2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоЗатрат3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратСФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоЗатратСФ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоЗатратСФ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоЗатратСФ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/CommonModules/ПроведениеРасчетовПоЗарплатеСерверПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ ПО СОТРУДНИКУ

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.СведенияОСотруднике 
// Функция - получает Сведения о сотруднике
//
// Возвращаемое значение:
//  СведенияОСотруднике - Структура
Функция СведенияОСотруднике(Период, Организация, ФизЛицо) Экспорт 
	СведенияОСотруднике = РегистрыСведений.Сотрудники.ПолучитьПоследнее(Период, 
		Новый Структура("Организация, ФизЛицо", Организация, ФизЛицо));
	СведенияОСотруднике.Вставить("ВидРасчета", ПланыВидовРасчета.ВидыНачислений.ПустаяСсылка());
	СведенияОСотруднике.Вставить("РазмерОсновногоВидаРасчета", 0);
	СведенияОСотруднике.Вставить("Валюта", Справочники.Валюты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлановыеНачисленияНачалоСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ПлановыеНачисленияНачалоСрезПоследних.Размер КАК РазмерОсновногоВидаРасчета,
		|	ПлановыеНачисленияНачалоСрезПоследних.Валюта КАК Валюта,
		|	ПлановыеНачисленияНачалоСрезПоследних.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияНачало.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ФизЛицо = &ФизЛицо) КАК ПлановыеНачисленияНачалоСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияОкончание.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ФизЛицо = &ФизЛицо) КАК ПлановыеНачисленияОкончаниеСрезПоследних
		|		ПО ПлановыеНачисленияНачалоСрезПоследних.Организация = ПлановыеНачисленияОкончаниеСрезПоследних.Организация
		|			И ПлановыеНачисленияНачалоСрезПоследних.ФизЛицо = ПлановыеНачисленияОкончаниеСрезПоследних.ФизЛицо
		|			И ПлановыеНачисленияНачалоСрезПоследних.ВидРасчета = ПлановыеНачисленияОкончаниеСрезПоследних.ВидРасчета
		|			И ПлановыеНачисленияНачалоСрезПоследних.Регистратор = ПлановыеНачисленияОкончаниеСрезПоследних.ДокументСсылка
		|ГДЕ
		|	ПлановыеНачисленияНачалоСрезПоследних.Основной
		|	И ПлановыеНачисленияОкончаниеСрезПоследних.Организация ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(СведенияОСотруднике, Выборка);	
	КонецЕсли;	

	Возврат СведенияОСотруднике;
КонецФункции // СведенияОСотруднике()

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.СтатусСотрудникаКакНалогоплательщика 
// Функция - получает статус сотрудника
//
// Возвращаемое значение:
//  Структура
Функция СтатусСотрудникаКакНалогоплательщика(Период, Организация, ФизЛицо) Экспорт 
	Возврат РегистрыСведений.СтатусыСотрудников.ПолучитьПоследнее(Период, Новый Структура("Организация, ФизЛицо", Организация, ФизЛицо));
КонецФункции // СтатусСотрудникаКакНалогоплательщика()

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.СпособОтраженияЗаработнойПлаты 
//
Функция СпособОтраженияЗаработнойПлаты(СтруктураОтбора) Экспорт 

	СпособОтражения = Справочники.СпособыОтраженияЗаработнойПлаты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпособыОтраженияЗаработнойПлаты.Подразделение КАК Подразделение,
		|	СпособыОтраженияЗаработнойПлаты.ВидРасчета КАК ВидРасчета,
		|	СпособыОтраженияЗаработнойПлаты.Ссылка КАК СпособОтражения
		|ПОМЕСТИТЬ ВременнаяТаблицаСпособыОтраженияЗаработнойПлаты
		|ИЗ
		|	Справочник.СпособыОтраженияЗаработнойПлаты КАК СпособыОтраженияЗаработнойПлаты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// 1. По Виду расчета и Подразделению.
		|ВЫБРАТЬ
		|	СпособыОтраженияЗаработнойПлаты.СпособОтражения КАК СпособОтражения
		|ПОМЕСТИТЬ ВременнаяТаблицаСчетаУчетаЗПОтбор
		|ИЗ
		|	ВременнаяТаблицаСпособыОтраженияЗаработнойПлаты КАК СпособыОтраженияЗаработнойПлаты
		|ГДЕ
		|	СпособыОтраженияЗаработнойПлаты.Подразделение = &Подразделение
		|	И СпособыОтраженияЗаработнойПлаты.ВидРасчета = &ВидРасчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// 2. По Виду расчета и пустому подразделению.
		|ВЫБРАТЬ
		|	СпособыОтраженияЗаработнойПлаты.СпособОтражения КАК СпособОтражения
		|ИЗ
		|	ВременнаяТаблицаСпособыОтраженияЗаработнойПлаты КАК СпособыОтраженияЗаработнойПлаты
		|ГДЕ
		|	СпособыОтраженияЗаработнойПлаты.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	И СпособыОтраженияЗаработнойПлаты.ВидРасчета = &ВидРасчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// 3. По подразделению и пустому виду расчета.
		|ВЫБРАТЬ
		|	СпособыОтраженияЗаработнойПлаты.СпособОтражения КАК СпособОтражения
		|ИЗ
		|	ВременнаяТаблицаСпособыОтраженияЗаработнойПлаты КАК СпособыОтраженияЗаработнойПлаты
		|ГДЕ
		|	СпособыОтраженияЗаработнойПлаты.Подразделение = &Подразделение
		|	И СпособыОтраженияЗаработнойПлаты.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНачислений.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// 4. По пустому подразделению и пустому виду расчета.
		|ВЫБРАТЬ
		|	СпособыОтраженияЗаработнойПлаты.СпособОтражения КАК СпособОтражения
		|ИЗ
		|	ВременнаяТаблицаСпособыОтраженияЗаработнойПлаты КАК СпособыОтраженияЗаработнойПлаты
		|ГДЕ
		|	СпособыОтраженияЗаработнойПлаты.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	И СпособыОтраженияЗаработнойПлаты.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНачислений.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВременнаяТаблицаСчетаУчетаЗПОтбор.СпособОтражения КАК СпособОтражения
		|ИЗ
		|	ВременнаяТаблицаСчетаУчетаЗПОтбор КАК ВременнаяТаблицаСчетаУчетаЗПОтбор";
	Запрос.УстановитьПараметр("Подразделение", СтруктураОтбора.Подразделение);
	Запрос.УстановитьПараметр("ВидРасчета", СтруктураОтбора.ВидРасчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		СпособОтражения = ВыборкаДетальныеЗаписи.СпособОтражения;
	КонецЕсли;;
	
	Возврат СпособОтражения;	
КонецФункции 

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.НормыБольничныхЛистов 
// Функция - получает размеры для расчета больничных листов в зависимости от стажа
//
// Возвращаемое значение:
//  Структура
Функция НормыБольничныхЛистов(КоличествоЛетСтажа) Экспорт 

	Размеры = Новый Структура;
	Размеры.Вставить("НижняяГраница", 0);
	Размеры.Вставить("ДнейОрганизации", 0);
	Размеры.Вставить("Процент", 0);
	Размеры.Вставить("ПроцентБеременность", 0);
	Размеры.Вставить("РазмерЗаСчетСФ", 0);
	Размеры.Вставить("РазмерБеременностьЗаСчетСФ", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НормыБольничныхЛистов.НижняяГраница КАК НижняяГраница,
		|	НормыБольничныхЛистов.ДнейОрганизации КАК ДнейОрганизации,
		|	НормыБольничныхЛистов.Процент КАК Процент,
		|	НормыБольничныхЛистов.ПроцентБеременность КАК ПроцентБеременность,
		|	НормыБольничныхЛистов.РазмерЗаСчетСФ КАК РазмерЗаСчетСФ,
		|	НормыБольничныхЛистов.РазмерБеременностьЗаСчетСФ КАК РазмерБеременностьЗаСчетСФ
		|ИЗ
		|	РегистрСведений.НормыБольничныхЛистов КАК НормыБольничныхЛистов
		|ГДЕ
		|	НормыБольничныхЛистов.НижняяГраница <= &КоличествоЛетСтажа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НижняяГраница УБЫВ";
	Запрос.УстановитьПараметр("КоличествоЛетСтажа", КоличествоЛетСтажа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Размеры, ВыборкаДетальныеЗаписи);	
	КонецЕсли;
	
	Возврат Размеры;	
КонецФункции // НормыБольничныхЛистов()
